# -*- coding: utf-8 -*-
"""
Created on Sat Mar  6 10:48:25 2021

@author: 22943
"""

import sys
 # 用户登录系统
Password = "123456"
input('请输入用户名：')
for i in range(6):
    if i==5:
        sys.exit()
    elif (i==0):
        password = input('请输入密码：')
    elif(password!=Password):
        n=5-i
        password = input('密码错误请重新输入（你还有{}次机会）：'.format(n))
    else:
        print('密码正确\n---------------欢迎来到城市查询系统---------------')
        break

#  城市数据
date = {
         '湖北':{
             '武汉市':['江岸区','江汉区','硚口区','汉阳区','武昌区','青山区','洪山区','东西湖区','汉南区','蔡甸区','江夏区','黄陂区','新洲区'],
             '黄石市':['黄石港区','西塞区','下陆区','铁山区','阳新县','大冶市'],
             '襄阳市':['襄城区','樊城区','襄州区','南漳县','保康县','老河口市','枣阳市','宜城市'],
             '洛阳市':['涧西区','西工区','老城区','瀍河回族区','洛龙区','吉利区','偃师市','孟津县','汝阳县','新安县','宜阳县','伊川县','洛宁县','嵩县','栾川县','汝阳县'],
             '荆州市':['沙市区','荆州区','公安县','监利县','江陵县','石首市','洪湖市','松滋市']
                  },
          '四川':{
              '成都市':['锦江区','青羊区','金牛区','武侯区','成华区','龙泉驿区','青白江区','新都区','温江区','双流区','金堂县','大邑县','浦江区','新津区','都江堰市','彭州市'],
              '自贡市':['自流井区','贡井区','大安区','沿滩区','容县','富顺县'],
              '攀枝花市':['东区','西区','仁和区','米易县','盐边县'],
              '德阳市':['旌阳区','罗江区','中江县','广汉市','什邡区','绵竹市'],
              '绵阳市':['涪城区','游仙区','安州区','三台县','盐亭县','梓潼县','北川羌族自治县','平武县','江油市']
                },
           '新疆':{
               '乌鲁木齐市':['天山区','沙依巴克区','新市区','水磨沟区','头屯河区','达坂城区','米东区','乌鲁木齐县'],
               '克拉玛依市':['克拉玛依区','独山子区','白碱滩区','乌尔禾区'],
               '吐鲁番':['鄯善县','托克逊县','高昌区'],
               '哈密市':['巴里坤哈萨克自治县','伊吾县','伊州区']
                 }
           }
#城市查询系统
if __name__ == "__main__":
    active = True
    while active:
        for i1 in date:
            print(i1)
        print("请输入你想要查询的省市或直辖市或特区(退出请输入quit)：")
        find_city = input("")  
        if find_city!= 'quit': 
            print("---查询结果如下---：")   
        if find_city in date:
            while active:
                for i2 in date[find_city]:
                    print(i2)  
                print("请输入二级城市(输入quit退出或输入back返回上一级)：")
                find_city2=input("")
                if find_city2!='quit':
                    print("---查询结果如下---：")
                if find_city2 in date[find_city]:
                    while active:
                        for i3 in date[find_city][find_city2]:
                            print(i3)
                        print("查询结束，输入quit退出或输入back返回上一级：")
                        com=input("")
                        if com!='quit':
                            print("---查询结果如下---：")
                        if com=="quit":
                            active=False
                        if com=="back":
                            break
                if find_city2=="quit":
                    active = False
                if find_city2=="back":
                    break
        if find_city=="quit":
            active=False